/* Initial login prompt for username and password */
"Login {0} with username and password" = "Loguj z nazwą użytkownika i hasłem";

/* Lookup of password in Keychain */
"No login credentials could be found in the Keychain" = "Nie odnaleziono mandatu logowania w Keychain";
"The use of the Keychain is disabled in the Preferences" = "Korzystanie z Keychain jest wyłączone w preferencjach";

/* Password proctected private key for SSH public key authentication */
"Invalid passphrase" = "Invalid passphrase";
"Private key password protected" = "Hasło prywatnego klucza zabezpieczone";
"Enter the passphrase for the private key file" = "Wprowadź hasło dla pliku prywatnego klucza";

"Login canceled" = "Logowanie anulowane";
"Login failed" = "Logowanie nieudane";
"Login successful" = "Logowanie udane";

/* Private key selection for SSH public key authentication */
"Select the private key in PEM or PuTTY format" = "Select the private key in PEM or PuTTY format";

/* Challenge-Respone authentication */
"Partial authentication success" = "Partial authentication success";
"Provide additional login credentials" = "Provide additional login credentials";

/* Login prompt placeholders */
"Username" = "Nazwa użytkownika";
"Password" = "Hasło";

/* Warning when credentials are sent using unsecured protocol. Unsecure FTP connection */
"Unsecured {0} connection" = "Unsecured {0} connection";

/* Credentials sent over plaintext connection */
"{0} will be sent in plaintext." = "{0} will be sent in plaintext.";
"Don't show again" = "Don't show again";
"Continue" = "Continue";
"Disconnect" = "Disconnect";

/* Protocol switch proposal */
"The server supports encrypted connections. Do you want to switch to {0}?" = "The server supports encrypted connections. Do you want to switch to {0}?";
"Change" = "Change";